import numpy as np

A = np.array([[2, 1, -1],
              [-3, -1, 2],
              [-2, 1, 2]], dtype=float)

b = np.array([8, -11, -3], dtype=float)


A_1 = np.array([[1, -1],
                [2, 1]], dtype=float)

b_1 = np.array([-5, -7], dtype=float)


A_2 = np.array([[3, 2, -5],
                [2, -1, 3],
                [1, 2, -1]], dtype=float)

b_2 = np.array([-1, 13, 9], dtype=float)

#у матрицы бесконечное количество решений
A_7 = np.array([[0.0, 0.0, 0.0, 0.0, 0.0],
                [-0.53, 0.0, 2.33, 0.24, 0.76],
                [-0.2, 0.89, 0.0, 0.77, 0.23],
                [-0.87, 0.26, 3.45, 0.0, -1.05],
                [1.24, 0.34, -0.2, 0.89, 0.0]], dtype=float)
b_7 = np.array([0, 4.2, 4.2, 4.2, 4.2], dtype=float)

#у матрицы нет решений
A_8 = np.array([[0.0, 0.0, 0.0, 0.0, 0.0],
                [-0.53, 0.0, 2.33, 0.24, 0.76],
                [-0.2, 0.89, 0.0, 0.77, 0.23],
                [-0.87, 0.26, 3.45, 0.0, -1.05],
                [1.24, 0.34, -0.2, 0.89, 0.0]], dtype=float)

b_8 = np.array([4.2, 4.2, 4.2, 4.2, 4.2], dtype=float)

#матрица с нулями по диагонали
A_9 = np.array([[0.0, 2.33, 0.24, 0.67, 0.92],
                [-0.53, 0.0, 2.33, 0.24, 0.76],
                [-0.2, 0.89, 0.0, 0.77, 0.23],
                [-0.87, 0.26, 3.45, 0.0, -1.05],
                [1.24, 0.34, -0.2, 0.89, 0.0]], dtype=float)

b_9 = np.array([4.2, 4.2, 4.2, 4.2, 4.2], dtype=float)

A_10 = np.array([[3.0]], dtype=float)
b_10 = np.array([6.0], dtype=float)